{
    "timeline": [
        {
            "year": 2025,
            "title": "Gibraltar Coastal Skipper",
            "distance": "Gibraltar Strait",
            "type": "certification",
            "preview": "Achieved Coastal Skipper certification in Gibraltar, mastering navigation in challenging strait conditions.",
            "full": "Completed intensive Coastal Skipper course in Gibraltar, focusing on advanced navigation techniques, weather routing, and handling challenging conditions in the Strait of Gibraltar. The course covered night navigation, emergency procedures, and advanced seamanship skills required for coastal and offshore sailing."
        },
        {
            "year": 2025,
            "title": "Morocco Coastal Trip",
            "distance": "Gibraltar to Tangier",
            "type": "milestone",
            "preview": "Successfully completed coastal navigation from Gibraltar to Tangier, Morocco.",
            "full": "Led a crew on a coastal navigation trip from Gibraltar to Tangier, Morocco. This journey involved crossing international waters, dealing with varying weather conditions, and navigating through busy shipping lanes. The trip provided valuable experience in international sailing and crew management."
        },
        {
            "year": 2024,
            "title": "Sailboat Sale",
            "distance": "N/A",
            "type": "milestone",
            "preview": "Successfully sold previous sailboat and upgraded to new vessel.",
            "full": "Completed the sale of previous sailboat and acquired a new vessel better suited for longer voyages and more challenging conditions. This transition involved extensive boat surveying, negotiation, and transfer of ownership documentation."
        },
        {
            "year": 2023,
            "title": "Mediterranean Cruise",
            "distance": "500+ nautical miles",
            "type": "milestone",
            "preview": "Completed extended Mediterranean cruise visiting multiple ports and islands.",
            "full": "Embarked on an extended Mediterranean cruise covering over 500 nautical miles. The journey included stops at various ports and islands, providing experience in different sailing conditions, port procedures, and international maritime regulations. This trip significantly enhanced offshore sailing skills and confidence."
        },
        {
            "year": 2022,
            "title": "Day Skipper Certification",
            "distance": "Various training areas",
            "type": "certification",
            "preview": "Obtained Day Skipper certification, qualifying to skipper yachts up to 24 meters.",
            "full": "Successfully completed Day Skipper course, gaining comprehensive knowledge of navigation, seamanship, and yacht handling. The certification qualifies to skipper yachts up to 24 meters in familiar waters during daylight hours. Course included practical navigation, safety procedures, and crew management."
        },
        {
            "year": 2021,
            "title": "Competent Crew Training",
            "distance": "Training waters",
            "type": "training",
            "preview": "Completed Competent Crew course, learning fundamental sailing skills and safety procedures.",
            "full": "Attended Competent Crew course to develop fundamental sailing skills including rope work, sail handling, helming, and safety procedures. This foundational training provided essential knowledge for safe participation in sailing activities and crew operations."
        },
        {
            "year": 2020,
            "title": "First Solo Sail",
            "distance": "50 nautical miles",
            "type": "milestone",
            "preview": "Completed first solo sailing trip, marking a significant personal achievement.",
            "full": "Successfully completed first solo sailing trip covering 50 nautical miles. This milestone represented a major step in sailing confidence and independence, requiring complete self-reliance in navigation, boat handling, and decision-making under various conditions."
        },
        {
            "year": 2019,
            "title": "Sailing Course Introduction",
            "distance": "Local waters",
            "type": "training",
            "preview": "Began formal sailing education with introductory courses.",
            "full": "Started formal sailing education with introductory courses covering basic sailing theory, safety procedures, and practical skills. These foundational courses provided the essential knowledge and confidence to begin sailing independently and pursue further certifications."
        },
        {
            "year": 2018,
            "title": "First Sailing Experience",
            "distance": "Local waters",
            "type": "milestone",
            "preview": "First introduction to sailing, sparking passion for maritime activities.",
            "full": "Experienced sailing for the first time, which ignited a passion for maritime activities and ocean navigation. This initial experience led to the decision to pursue formal sailing education and certifications to develop professional sailing skills."
        }
    ]
}